#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Сообщения
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################
# Персональные
from neweraai.modules.core.language import Language  # Определение языка

# ######################################################################################################################
# Сообщения
# ######################################################################################################################
class Messages(Language):
    """Сообщения"""

    # ------------------------------------------------------------------------------------------------------------------
    # Конструктор
    # ------------------------------------------------------------------------------------------------------------------

    def __init__(self):
        super().__init__()  # Выполнение конструктора из суперкласса

        self._metadata: str = self._(
            '[{}] Запуск:\n    '
            'Автор: {}\n    '
            'Email: {}\n    '
            'Сопровождающие: {}\n    '
            'Версия: {}')

        self._format_time: str = '%Y-%m-%d %H:%M:%S'  # Формат времени

        self._method_not_supported: str = self._('"{}.{}" не поддерживается в данной среде использования пакета ...')
        self._invalid_arguments: str = self._('Неверные типы или значения аргументов в "{}" ...')
        self._invalid_args: str = self._('Необходимые значения в командной строке не найдены ...')

        self._som_ww: str = self._('Ой! Что-то пошло не так ... смотрите настройки ядра и цепочку выполнения действий '
                                   '...')
        self._unknown_err: str = self._('Прям беда! Не обработанную ошибку необходимо проанализировать и выявить '
                                        'причину ...')