#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Настройки ядра
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################
# Персональные
from neweraai.modules.core.messages import Messages  # Сообщения

# ######################################################################################################################
# Настройки ядра
# ######################################################################################################################
class Settings(Messages):
    """Настройки ядра"""

    # ------------------------------------------------------------------------------------------------------------------
    # Конструктор
    # ------------------------------------------------------------------------------------------------------------------

    def __init__(self):
        super().__init__()  # Выполнение конструктора из суперкласса

        self.text_runtime: str = self._('Время выполнения')  # Текст времени выполнения
        self.color_runtime: str = '#666'  # Цвет текста
        self.bold_runtime: bool = True  # Жирность текста

    # ------------------------------------------------------------------------------------------------------------------
    # Свойства
    # ------------------------------------------------------------------------------------------------------------------

    # Получение текста времени выполнения
    @property
    def text_runtime(self): return self._text_runtime

    # Установка текста времени выполнения
    @text_runtime.setter
    def text_runtime(self, text):
        if type(text) is not str or len(text) < 1: return self._text_runtime
        else: self._text_runtime = text

    # Получение цвета текста времени выполнения
    @property
    def color_runtime(self): return self._color_runtime

    # Установка цвета текста времени выполнения
    @color_runtime.setter
    def color_runtime(self, color): self._color_runtime = color

    # Получение жирности текста времени выполнения
    @property
    def bold_runtime(self): return self._bold_runtime

    # Установка жирности текста времени выполнения
    @bold_runtime.setter
    def bold_runtime(self, bold): self._bold_runtime = bold